Revit 2023 API
GroupTypeId.SegmentsFittings Property
 "Segments and Fittings"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId SegmentsFittings { get; }
Visual Basic
Public Shared ReadOnly Property SegmentsFittings As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SegmentsFittings {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace